app/controllers/portfolios_controller.rb

  def index
    @portfolios = Portfolio.all
---
SELECT * FROM "portfolios"

  def show
    @portfolio = Portfolio.find(params[:id])
---
SELECT * FROM `portfolios` WHERE (`portfolios`.`id` = 1)

  def edit
    @portfolio = Portfolio.find(params[:id])
---
SELECT * FROM "portfolios" WHERE ("portfolios"."id" = 1)

  def create
    @portfolio = Portfolio.new(params[:portfolio])

    respond_to do |format|
      if @portfolio.save
---
INSERT INTO "portfolios" ("name", "created_at", "updated_at", "user_id") VALUES('A', '2010-03-04 22:27:25', '2010-03-04 22:27:25', 1)