app/controllers/splits_controller.rb

  def create
    @split = Split.new(params[:split])

    if @split.save
---
INSERT INTO "splits" ("new", "created_at", "updated_at", "split_mul_factor", "date", "old", "stock_id", "stock_adjusted_for_split") VALUES(3, '2010-02-21 19:06:25', '2010-02-21 19:06:25', NULL, '2010-02-21', 2, 1, 'f')

  def index
    @splits = Split.all
---
SELECT * FROM "splits"

  def destroy
    @split = Split.find(params[:id])
    @split.destroy
---
SELECT * FROM "splits" WHERE ("splits"."id" = 1)
DELETE FROM "splits" WHERE "id" = 1