app/controllers/stocks_controller.rb

SELECT * FROM "stocks"
---
  def index
    @stocks = Stock.search(params[:search])

INSERT INTO "stocks" ("shares", "name", "comission", "created_at", "updated_at", "buy_price", "sell_date", "buy_date", "sell_price", "market_price", "ticker") VALUES(1234, '', NULL, '2010-02-21 18:34:54', '2010-02-21 18:34:54', 123.0, NULL, '2010-02-21', NULL, NULL, 'sdf')
---
  def create
    @stock = Stock.new(params[:stock])

    respond_to do |format|
      if @stock.save

UPDATE "stocks" SET "sell_date" = '2010-02-18', "updated_at" = '2010-02-18 02:50:21' WHERE "id" = 1
---
  def update
     @stock = Stock.find_by_ticker(params[:id])

    if @stock.update_attributes(params[:stock])

DELETE FROM "stocks" WHERE "id" = 1
---
  def destroy
    @stock = Stock.find_by_ticker(params[:id])
    @stock.destroy