app/controllers/transactions_controller.rb

  def index
    @transactions = Transaction.all
---
SELECT * FROM "transactions"

  def new
    @transaction = Transaction.new
    @portfolio = Portfolio.find(params[:portfolio_id])
---
SELECT * FROM `portfolios` WHERE (`portfolios`.`id` = 1)

  def create
    @transaction = Transaction.new(params[:transaction])

    if @transaction.save
---
INSERT INTO "transactions" ("comission", "shares", "price", "created_at", "updated_at", "date", "stock_id", "portfolio_id") VALUES(12.0, 12, 12.0, '2010-03-09 19:35:17', '2010-03-09 19:35:17', '2010-03-09', 1, NULL)